Repository: minhquang39/App_M3u8ToMp4
Catalog: M3U8ConverterApp/Resources/Strings.*.resx
Languages: vi

# WindowTitle
source: M3U8 to MP4 Converter
vi: Chuyển đổi M3U8 sang MP4

# Tab_Conversion
source: Conversion
vi: Chuyển đổi

# Tab_Settings
source: Settings
vi: Cài đặt

# Label_M3U8Url
source: M3U8 URL:
vi: Đường dẫn M3U8:

# Label_OutputFile
source: Output file:
vi: File đầu ra:

# Label_Downloader
source: Downloader:
vi: Công nghệ tải:

# Label_FfmpegPath
source: FFmpeg path:
vi: Đường dẫn FFmpeg:

# Label_Nm3u8DlRePath
source: N_m3u8DL-RE path:
vi: Đường dẫn N_m3u8DL-RE:

# Label_ThreadCount
source: Thread count:
vi: Số luồng tải:

# Label_Language
source: Language:
vi: Ngôn ngữ:

# Button_Paste
source: Paste
vi: Dán

# Button_Browse
source: Browse...
vi: Chọn...

# Button_Start
source: Start
vi: Bắt đầu

# Button_Cancel
source: Cancel
vi: Hủy bỏ

# Button_OpenOutputFolder
source: Open output folder
vi: Mở thư mục đầu ra

# Checkbox_AggressiveHttp
source: Aggressive HTTP (persistent & multiple requests for VOD)
vi: HTTP tích cực (kết nối liên tục & yêu cầu đa luồng cho VOD)

# GroupBox_ActivityLog
source: Activity log
vi: Nhật ký hoạt động

# GroupBox_FfmpegConfiguration
source: FFmpeg Configuration
vi: Cấu hình FFmpeg

# GroupBox_Nm3u8Configuration
source: N_m3u8DL-RE Configuration
vi: Cấu hình N_m3u8DL-RE

# Engine_Ffmpeg_Name
source: FFmpeg (sequential)
vi: FFmpeg (tải tuần tự)

# Engine_Ffmpeg_Description
source: Use ffmpeg to download sequentially.
vi: Sử dụng ffmpeg để tải xuống tuần tự.

# Engine_Nm3u8_Name
source: N_m3u8DL-RE (parallel)
vi: N_m3u8DL-RE (tải song song)

# Engine_Nm3u8_Description
source: Use N_m3u8DL-RE to download segments concurrently.
vi: Sử dụng N_m3u8DL-RE để tải các phân đoạn đồng thời.

# Status_Idle
source: Idle
vi: Sẵn sàng

# Status_Converting
source: Converting
vi: Đang chuyển đổi

# Status_Cancelled
source: Cancelled
vi: Đã hủy

# Status_Completed
source: Completed
vi: Hoàn thành

# Tooltip_M3U8Url
source: Remote playlist URL (.m3u8)
vi: URL danh sách phát từ xa (.m3u8)

# Tooltip_OutputFile
source: Destination MP4 path
vi: Đường dẫn file MP4 đầu ra

# Tooltip_PasteUrl
source: Paste URL from clipboard
vi: Dán URL từ clipboard

# Tooltip_FfmpegPath
source: Location of ffmpeg.exe
vi: Vị trí của ffmpeg.exe

# Tooltip_Nm3u8Path
source: Location of N_m3u8DL-RE.exe
vi: Vị trí của N_m3u8DL-RE.exe

# Tooltip_ThreadCount
source: Maximum number of segments to download concurrently (1-128).
vi: Số lượng phân đoạn tối đa tải cùng lúc (1-128).

# Tooltip_AggressiveHttp
source: Adds -multiple_requests 1 and -http_persistent 1 to ffmpeg to reuse HTTP connections.
vi: Thêm -multiple_requests 1 và -http_persistent 1 vào ffmpeg để tái sử dụng kết nối HTTP.

# Info_ThreadCountNote
source: Higher values increase concurrency but may stress the server.
vi: Giá trị cao hơn tăng tốc độ nhưng có thể gây tải cho máy chủ.

# Info_SettingsNote
source: Note: FFmpeg is required for both download methods. N_m3u8DL-RE path is only needed when using parallel download mode.
vi: Lưu ý: FFmpeg bắt buộc cho cả hai phương thức tải. Đường dẫn N_m3u8DL-RE chỉ cần thiết khi sử dụng chế độ tải song song.

# TrayIcon_Title
source: M3U8 to MP4 Converter
vi: Chuyển đổi M3U8 sang MP4

# TrayIcon_Message
source: Application is still running in the background. Click the tray icon to restore.
vi: Ứng dụng vẫn đang chạy trong nền. Nhấp vào biểu tượng khay để khôi phục.

# TrayIcon_ShowWindow
source: Show Window
vi: Hiển thị cửa sổ

# TrayIcon_Exit
source: Exit
vi: Thoát
